cask_args appdir: '/Applications'

# command line tools
brew 'aerial'
brew 'composer'
brew 'exiftool'
brew 'ffmpeg'
brew 'lua'
brew 'macvim'
brew 'mysql'
brew 'node'
brew 'npm'
brew 'smartmontools'
brew 'redis'
brew 'rethinkdb'
brew 'python3'
brew 'yarn'
brew 'youtube-dl'

# Casked GUI applications
cask 'iina'
cask 'paw'
cask 'phpstorm'
cask 'pycharm'
cask 'sequel pro'
cask 'sketch'
cask 'tower'
cask 'transmission'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'

# Mac App Store
mas 'gifox'
mas 'magnet'
mas 'numbers'
mas 'pages'
mas 'paprika recipe manager 3'
mas 'world clock pro'