cask_args appdir: '/Applications', require_sha: true

brew "act"
brew "ansible"
brew "awscli"
brew "asw-elasticbeanstalk"
brew "composer"
brew "direnv"
brew "docker"
# See: https://github.com/kcrawford/dockutil/issues/127
# brew "dockutil"
brew "doctl"
brew "exiftool"
brew "ffmpeg"
brew "gh"
brew "htop"
brew "kubectl"
brew "jq"
brew "mas"
brew "node"
brew "pam-reattach"
brew "php"
brew "postgresql"
brew "rbenv"
brew "terraform"
brew "thefuck"
brew "s3cmd"
brew "smartmontools"
brew "stripe"
brew "wget"
brew "yarn"
brew "yt-dlp"

cask "affinity-designer"
cask "affinity-photo"
cask "altserver"
cask "bartender"
cask "bitwarden"
cask "choosy"
cask "discord"
cask "firefox"
cask "fork"
cask "gifox"
cask "google-chrome"
cask "google-drive"
cask "iina"
cask "iterm2"
cask "microsoft-edge"
cask "openvpn-connect"
cask "paw"
cask "phpstorm"
cask "raycast"
cask "rectangle-pro"
cask "rubymine"
cask "session-manager-plugin"
cask "sf-symbols"
cask "slack"
cask "tableplus"
cask "the-unarchiver"
cask "transmission"
cask "tweetbot"
cask "visual-studio-code"

# Install from Mac App Store
mas "1Password", id: 1333542190
mas "AdGuard for Safari", id: 1440147259
mas "Apple Developer", id: 640199958
mas "Cascadea", id: 1432182561
mas "ColorSlurp", id: 1287239339
mas "Deliveries", id: 290986013
mas "Enpass", id: 732710998
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Xcode", id: 497799835